/*
 *  ::718604!
 * 
 * Copyright(C) November 20, 2014 U.S. Food and Drug Administration
 * Authors: Dr. Vahan Simonyan (1), Dr. Raja Mazumder (2), et al
 * Affiliation: Food and Drug Administration (1), George Washington University (2)
 * 
 * All rights Reserved.
 * 
 * The MIT License (MIT)
 * 
 * Permission is hereby granted, free of charge, to any person obtaining
 * a copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 * 
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 * 
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 */
#include <ulib/ucgi.hpp>
using namespace slib;
const char * sUsrCGI::encCodes={"\
SEVAK \
Ինձ հետ լինի, թե առանց ինձ, իմ բալիկս, կմեծանաս,\
Իմ օգնությամբ, թե առանց ինձ, դու երբևէ կհասկանաս,\
Թե ոնց պիտի ապրել կյանքում, թե ոնց պիտի նայել կյանքին,\
Թե աշխարհում ինչն է էժան, թե աշխարհում ինչն է անգին։\
Ինքս էլ խրատ կարդացողին ոչ հարգում եմ, ոչ հանդուրժում,\
Տափակ թե սուր քարոզներից ինքս էլ եմ միշտ, տղաս, խորշում։\
Ու թե հիմա, իմ բալիկըս, ես քո գլխին ճառ եմ կարդում,\
Ապա միայն նրա համար, որ շատ հաճախ կյանքում մարդու\
Եթե իր մեծ բաժինն ունի ժամանակը, ինքը դարը,\
Բայց և այնպես քիչ չի ազդում նաև ընտրած ճանապարհը։\
Գուցե քեզ հետ նույնը լինի, որ պատել է հաճախ ինձ է՛լ.\
Հաճախ, շուրջըս աչք ածելով, այն մարդկանց եմ ես նախանձել,\
Որոնց կյանքը հեշտ է անցնում – ասես կյա՜նք չէ, այլ խճուղի՝\
Անխոչընդո՜տ և անարգելք, քանոնի պես հա՜րթ ու ուղիղ.\
Դպրոց, հետո ինչ-որ մի ԲՈՒՀ, մի ազդեցիկ զանգահարող,-\
Եվ տաք տեղն է ապահովված… Այսպես ապրել դու չե՜ս կարող։\
Չէի ուզի, որ քո կյանքը հարթ խճուղու նման լիներ։\
Դու մի՛ անցիր ասֆալտ ճամփով, գերադասիր ճամփա՜ շինել։\
\
Դու սիրո հետ միշտ հաշտ ապրիր, բայց խույս մի տա տառապանքից.\
Նա սրբում է աչքը փոշուց, նա մաքրում է հոգին ժանգից։\
Տառապանքից չեն մեռնում, չէ՛, այլ ավելի են պնդանում,-\
Ապաքինված սիրտը հետո գալիք ցավը հեշտ է տանում։\
Ա՜խ, մի՛ նվա։ Հայրըդ երբեք չէր հանդուրժում նվացողին…\
Շատ ավելի լավ է, տղա՛ս, դառն արցունքով աչքըդ ցողիր\
Ու քո ճամփան շարունակիր։ Թո՛ղ որ լինի նա քարքարոտ,\
Բայց քո հոգում եթե լինի բարո՛ւ, լավի՛, սիրո՛ կարոտ,\
Դու չե՜ս հոգնի, դու կքայլես, կբարձրանաս դու սարն ի վեր։\
Դրա համար ոգի է պետք, դրա համար պետք չեն թևեր։\
\
Ազնիվ եղիր ամեն ինչում – ո՞վ է կյանքում սովից մեռել։\
Ճշտի համար աքսոր չկա – ստի հանդեպ ինչո՞ւ լռել։\
Իսկ մեր շուրջը դեռ կան մարդիկ, որ երբ պետք է մեջք են ծռում,\
Երբ որ պետք է հռհռում են, պե՞տք է՝ ժպտո՛ւմ, պե՞տք է՝ լռո՛ւմ,\
Պե՞տք է՝ իրենց մատն են տնկում … Դու մի եղիր կյանքում տհաս՝\
Դու հասկացիր հենց այս գլխից, մի մոռացիր երբեք, տղա՛ս.\
Ազնըվությունն այն է միայն, որ չի փոխվում՝ ոնց էլ շուռ տաս,-\
Նա մի ճերմակ երես ունի, ոչ թե յոթ-ութ գունեղ աստառ…\
\
Մի՛ տրտնջա։ Դու հիշո՞ւմ ես. «Ձախորդ օրեր… կուգան-կերթան»…\
Մի՛ տրտնջա։ Եթե լավից ետ ես ընկել՝ ինքդ հասիր…\
Մի՛ տրտնջա, բայց և կյանքը գրքի նման դու մի կարդա,\
Գրքի նման՝ քեզնից հեռու, ինչ-որ օտար մարդկանց մասին…\
Հպարտ եղիր, բայց ոչ գոռոզ (դատարկ մարդն է գոռոզանում,\
Հայրդ խելոք ու տխմարին դրանով էր զանազանում)։\
Հորըդ նման հպարտ զգա, որ ոչ մեկի տուն չես քանդել,\
Ոչ մի ազնիվ խոսք չես կտրել, ոչ մի ազնիվ միտք չես բանտել,\
Որ շիտակ ես քայլել կյանքում և լռել ես եթե հաճախ,\
Ապա միայն նրա համար, որ առևտուրը մանրածախ\
Հաճախ միայն զիզի-բիզի զանգուլակ է նետել շուկա,\
Իսկ դու զուրկ ես զիզի-բիզուց, կեղծ դրամ էլ մոտըդ չկա…\
\
Դու փոքր ես դեռ, դեռ չգիտես, թե ոնց պիտի կյանքին նայել։\
Դու փոքր ես դեռ։ Երբ մեծանաս, դառնաս արդեն հասուն ջահել,\
Խորհուրդներն իմ և՛ հնացած, և՛ ավելորդ թվան գուցե –\
Կյանքում այնժամ էլ չլինեն նման բացեր, նման խոցեր։\
Է՛հ, տա աստված։ Ես էլ կյանքում ուրիշ ոչինչ չեմ երազում\
(Կույրը, տղաս, ինչպես գիտես, երկու աչք է միայն ուզում)։\
Խորհուրդներն իմ թող հնանան… Ծաղիկն է լոկ այդպես մեռնում,\
Երբ ամռանը ծառի վրա հասուն միրգ է արդեն դառնում։\
Հանուն գալիք վառ խարույկի ես պատրաստ եմ այսօր ծխալ,\
Հանուն վաղվա ճշմարտության թող որ այսօր լինեմ սխալ…\
\
CHARENC\
\
Ես իմ անուշ Հայաստանի արևահամ բարն եմ սիրում,\
Մեր հին սազի ողբանվագ, լացակումած լարն եմ սիրում,\
Արնանման ծաղիկների ու վարդերի բույրը վառման,\
Ու նաիրյան աղջիկների հեզաճկուն պա՛րն եմ սիրում։\
\
Սիրում եմ մեր երկինքը մուգ, ջրերը ջինջ, լիճը լուսե,\
Արևն ամռան ու ձմեռվա վիշապաձայն բուքը վսեմ,\
Մթում կորած խրճիթների անհյուրընկալ պատերը սև,\
Ու հնամյա քաղաքների հազարամյա քա՛րն եմ սիրում։\
\
Ո՛ւր էլ լինեմ - չե՛մ մոռանա ես ողբաձայն երգերը մեր,\
Չե՜մ մոռանա աղոթք դարձած երկաթագիր գրքերը մեր,\
Ինչքան էլ սո՜ւր սիրտս խոցեն արյունաքամ վերքերը մեր -\
Էլի՛ ես որբ ու արնավառ իմ Հայաստան - յա՛րն եմ սիրում։\
\
Իմ կարոտած սրտի համար ո՛չ մի ուրիշ հեքիաթ չկա․\
Նարեկացու, Քուչակի պես լուսապսակ ճակատ չկա․\
Աշխա՛րհ անցի՛ր, Արարատի նման ճերմակ գագաթ չկա․\
Ինչպես անհաս փառքի ճամփա՝ ես իմ Մասիս սա՛րն եմ սիրում։\
\
SEVAK \
\
Անկեղծ ասած՝ այս ամենից ես հոգնել եմ,\
Ես, սիրելի՛ս, որ քեզ սիրել և օգնել եմ.\
Ձեռք եմ պարզել, հույս եմ տվել,\
Վատըդ թողած՝ լավըդ թվել,\
Հավատացրել, հավատացել,\
Թե իմ առաջ դուռ ես բացել՝\
Չտեսնըված, չեղած մի դուռ։\
Սակայն ի՞նչ եմ ես ստացել\
Այդ ամենին ի տրիտուր։\
\
Անկեղծ ասած՝ ոչինչ չկա, և ոչ էլ կար։\
\
Անկեղծ ասած՝ դու բնավ էլ ա՛յն չես եղել,\
Ա՛յն չես եղել, ինչ որ ես եմ կարծել երկար։\
Ո՞ւր ես, ասա՛, դու ինձ մղել։\
Ճիշտ ճամփից ես միայն շեղել։\
Սուտ խոստումով կապել ես ինձ,\
Մանկան նման խաբել ես ինձ,\
Ու չես տվել ոչի՜նչ, ոչի՜նչ։\
Իսկ այն, ինչ որ ինձ ես տվել,\
Արժանի չէր ո՛չ քեզ, ո՛չ ինձ։\
\
Անկեղծ ասած՝ քո տվածից ես հոգնել եմ։\
\
Ինքդ գիտես՝ որքան ձգտել ու տքնել եմ,\
Որ դու … որ դու նման լինես իմ երազին։\
Իսկ դու գիտե՞ս՝ ի՛նչ դուրս եկավ.\
«Տղան հասավ իր մուրազին,\
Դուք էլ հասնեք ձեր մուրազին»։\
Հեքիաթն, այո, միտքըս ընկավ…\
Դու՝ հեքիաթում հրաշք աղջիկ,\
Այնինչ կյանքում՝ ինչ-որ… չղջիկ,\
Որ ոչ թռչուն, ոչ էլ մուկ է…\
\
Անկեղծ ասած՝ զուր էր ամբողջ այս աղմուկը։\
\
Անկեղծ ասած՝ նեղանում ես, թե լրջանում,\
Մե՜կ է հիմա։ Էլ չեմ գցի ինձ սար ու ձոր,\
Անկեղծ կասեմ՝ հեքիաթն ինչով է վերջանում.\
Ցած է ընկնում երեք խնձոր –\
Մեկ՝ ասողին,\
Մեկ՝ լսողին,\
Մեկ էլ… ինձ պես գիշեր ու զօր\
Հիմարաբար սպասողին…\
\
--------------------------------\
"};
};
"